pinbal-scsp/src/test/resources/es/caib/pinbal/scsp/peticio.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <ds:Signature 
            xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
            <ds:SignedInfo>
                <ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"></ds:CanonicalizationMethod>
                <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
                <ds:Reference URI="#MsgBody">
                    <ds:Transforms>
                        <ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"></ds:Transform>
                    </ds:Transforms>
                    <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
                    <ds:DigestValue>g+9k4/PnqfiHZCLM4WlANGOXoXw=</ds:DigestValue>
                </ds:Reference>
            </ds:SignedInfo>
            <ds:SignatureValue>
EdUQSqrKW9NqDbi18Ml2xH2y8o+MyMkOrPh8a33ziETLlrRIFU9orRJJ9GVr7XCxLidngAx+8zuA
W1BLuY1O5m9YJ+WHnlyvYemPl2my0ojQF5mgYVVM4cOG4/YHgjc33yFv/iG9o26EZJa/ng1XzzCR
g6AUzNGHHUTvM94vk14=
</ds:SignatureValue>
            <ds:KeyInfo>
                <ds:X509Data>
                    <ds:X509Certificate>
MIIHUjCCBjqgAwIBAgIIN5OKNVi0L+kwDQYJKoZIhvcNAQEFBQAwgbAxCzAJBgNVBAYTAkVTMRsw
GQYDVQQKExJBQyBDQU1FUkZJUk1BIFMuQS4xOzA5BgNVBAcTMk1BRFJJRCAoVmVyIGVuIGh0dHBz
Oi8vd3d3LmNhbWVyZmlybWEuY29tL2FkZHJlc3MpMRYwFAYDVQQLEw1BQyBDQU1FUkZJUk1BMRIw
EAYDVQQFEwlBODI3NDMyODcxGzAZBgNVBAMTEkFDIENBTUVSRklSTUEgQUFQUDAeFw0xMDExMDQx
MjQ0NDBaFw0xMzExMDMxMjQ0NDBaMIGqMTIwMAYDVQQNEylRdWFsaWZpZWQgQ2VydGlmaWNhdGU6
IEFBUFAtU0VQLU0tU1ctS1BTQzEfMB0GA1UEAxMWUExBVEFGT1JNQSBJTlRFR1JBQ0lPTjESMBAG
A1UEBRMJRzA3ODk2MDA0MRowGAYDVQQLFBFzZWxsbyBlbGVjdHLzbmljbzEWMBQGA1UEChQNRlVO
REFDSdMgSUJJVDELMAkGA1UEBhMCRVMwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAN47/iDm
G7y5ODDTLHvq1NZY93NrbuXwSuj2KLSke39T8ZHWQZDcv15y0rejclu8Xgaia2WiZyLEOB0HExBD
dh+dA66G/vlkRjSlO54nMy1uG2SNHSdYVvf22xrMSvPI+2EJADNx3hN5G5+z+0xm9/yAwtg5iH0v
Rg6r17Pi86nHAgMBAAGjggP2MIID8jAMBgNVHRMBAf8EAjAAMA4GA1UdDwEB/wQEAwIE8DAdBgNV
HSUEFjAUBggrBgEFBQcDAgYIKwYBBQUHAwQwHQYDVR0OBBYEFOpB6Tv3vGoS3aEqWkCljyKCp6Lt
MHoGCCsGAQUFBwEBBG4wbDBCBggrBgEFBQcwAoY2aHR0cDovL3d3dy5jYW1lcmZpcm1hLmNvbS9j
ZXJ0cy9BQ19DQU1FUkZJUk1BX0FBUFAuY3J0MCYGCCsGAQUFBzABhhpodHRwOi8vb2NzcC5jYW1l
cmZpcm1hLmNvbTCBqwYDVR0jBIGjMIGggBTlRlDoQ6Cy9xzktv/YAAQg9x+kC6GBhKSBgTB/MQsw
CQYDVQQGEwJFVTEnMCUGA1UEChMeQUMgQ2FtZXJmaXJtYSBTQSBDSUYgQTgyNzQzMjg3MSMwIQYD
VQQLExpodHRwOi8vd3d3LmNoYW1iZXJzaWduLm9yZzEiMCAGA1UEAxMZQ2hhbWJlcnMgb2YgQ29t
bWVyY2UgUm9vdIIBDTB6BgNVHR8EczBxMDagNKAyhjBodHRwOi8vY3JsLmNhbWVyZmlybWEuY29t
L0FDX0NBTUVSRklSTUFfQUFQUC5jcmwwN6A1oDOGMWh0dHA6Ly9jcmwxLmNhbWVyZmlybWEuY29t
L0FDX0NBTUVSRklSTUFfQUFQUC5jcmwwgZQGA1UdEQSBjDCBiaSBhjCBgzEhMB8GCWCFVAEDBQIB
AQwSc2VsbG8gZWxlY3Ryw7NuaWNvMR0wGwYJYIVUAQMFAgECDA5GVU5EQUNJw5MgSUJJVDEYMBYG
CWCFVAEDBQIBAwwJRzA3ODk2MDA0MSUwIwYJYIVUAQMFAgEFDBZQTEFUQUZPUk1BIElOVEVHUkFD
SU9OMCEGA1UdEgQaMBiBFnNvcG9ydGVAY2FtZXJmaXJtYS5jb20wggELBgNVHSAEggECMIH/MIH8
BgwrBgEEAYGHLgEDAwIwgeswKQYIKwYBBQUHAgEWHWh0dHBzOi8vcG9saWN5LmNhbWVyZmlybWEu
Y29tMIG9BggrBgEFBQcCAjCBsBqBrUNlcnRpZmljYWRvIHJlY29ub2NpZG8gZGUgc2VsbG8gZWxl
Y3Ry825pY28gZGUgQWRtaW5pc3RyYWNp824sIPNyZ2FubyBvIGVudGlkYWQgZGUgZGVyZWNobyBw
+mJsaWNvLCBuaXZlbCBNZWRpby4gQ29uc3VsdGUgY29uZGljaW9uZXMgZGUgdXNvIGVuIGh0dHBz
Oi8vcG9saWN5LmNhbWVyZmlybWEuY29tMCUGCCsGAQUFBwEDBBkwFzAIBgYEAI5GAQEwCwYGBACO
RgEDAgEPMA0GCSqGSIb3DQEBBQUAA4IBAQC+mdTcrMGVmk+LDC7P3Gwg2a1/j9qpfmdO2ayQFNsl
CjvZGZD3g8bgdbu0obH6+4fwMxVesJp0MoZpktOrBK1LqjkJWT4reL+dWpXnLQMF279dHJxShLdx
E1hQ+a/EDmTlGVu667eqxGx+Quu8IEPaXhfxUfXkuRsLhzhd1pY00mSbA34ev7XBcqPtBE1dV12O
9uUlKdkKVDapcdP891zIaJckQUyj44+CD5TRRV/qPvC8gIS0ozTbmgTsBH/m/jl34go7KaqEGdqI
nebGPX3V9aeHWqOZJBD+Xc8+HND0w31vFShxE8KfanzmKjdl1Q9SH1Zy9ZrQ7WyPSujRIXhx
</ds:X509Certificate>
                </ds:X509Data>
                <ds:KeyValue>
                    <ds:RSAKeyValue>
                        <ds:Modulus>
3jv+IOYbvLk4MNMse+rU1lj3c2tu5fBK6PYotKR7f1PxkdZBkNy/XnLSt6NyW7xeBqJrZaJnIsQ4
HQcTEEN2H50Drob++WRGNKU7niczLW4bZI0dJ1hW9/bbGsxK88j7YQkAM3HeE3kbn7P7TGb3/IDC
2DmIfS9GDqvXs+Lzqcc=
</ds:Modulus>
                        <ds:Exponent>AQAB</ds:Exponent>
                    </ds:RSAKeyValue>
                </ds:KeyValue>
            </ds:KeyInfo>
        </ds:Signature>
    </soapenv:Header>
    <soapenv:Body Id="MsgBody">
        <Peticion 
            xmlns="http://www.map.es/scsp/esquemas/V2/peticion">
            <Atributos>
                <IdPeticion>PBL0000000000505</IdPeticion>
                <NumElementos>1</NumElementos>
                <TimeStamp>2014-07-15T12:54:47.682+02:00</TimeStamp>
                <CodigoCertificado>pruebaPMI</CodigoCertificado>
            </Atributos>
            <Solicitudes>
                <SolicitudTransmision>
                    <DatosGenericos>
                        <Emisor>
                            <NifEmisor>S0711001H</NifEmisor>
                            <NombreEmisor>CAIB</NombreEmisor>
                        </Emisor>
                        <Solicitante>
                            <IdentificadorSolicitante>B07167448</IdentificadorSolicitante>
                            <NombreSolicitante>Limit Tecnologies</NombreSolicitante>
                            <Finalidad>ProvaConcepte#::##::#1234</Finalidad>
                            <Consentimiento>Si</Consentimiento>
                            <Funcionario>
                                <NombreCompletoFuncionario>Sion Andreu</NombreCompletoFuncionario>
                                <NifFuncionario>97669911C</NifFuncionario>
                            </Funcionario>
                        </Solicitante>
                        <Titular>
                            <TipoDocumentacion>NIF</TipoDocumentacion>
                            <Documentacion>12345678Z</Documentacion>
                        </Titular>
                        <Transmision>
                            <CodigoCertificado>pruebaPMI</CodigoCertificado>
                            <IdSolicitud>000000</IdSolicitud>
                            <FechaGeneracion>2014-07-15T12:54:47.663+02:00</FechaGeneracion>
                        </Transmision>
                    </DatosGenericos>
                    <DatosEspecificos 
                        xmlns="http://www.map.es/scsp/esquemas/datosespecificos">
                        <Solicitud>
                            <Provincia>
                                <Nombre>Illes Balears</Nombre>
                                <Codigo>07</Codigo>
                            </Provincia>
                            <Municipio>
                                <Codigo>033</Codigo>
                                <Nombre>Manacor</Nombre>
                            </Municipio>
                            <Tutor>SI</Tutor>
                        </Solicitud>
                    </DatosEspecificos>
                </SolicitudTransmision>
                <SolicitudTransmision>
                    <DatosGenericos>
                        <Emisor>
                            <NifEmisor>S0711001H</NifEmisor>
                            <NombreEmisor>CAIB</NombreEmisor>
                        </Emisor>
                        <Solicitante>
                            <IdentificadorSolicitante>B07167448</IdentificadorSolicitante>
                            <NombreSolicitante>Limit Tecnologies</NombreSolicitante>
                            <Finalidad>ProvaConcepte#::##::#1234</Finalidad>
                            <Consentimiento>Si</Consentimiento>
                            <Funcionario>
                                <NombreCompletoFuncionario>Sion Andreu</NombreCompletoFuncionario>
                                <NifFuncionario>97669911C</NifFuncionario>
                            </Funcionario>
                        </Solicitante>
                        <Titular>
                            <TipoDocumentacion>NIF</TipoDocumentacion>
                            <Documentacion>12345678Z</Documentacion>
                        </Titular>
                        <Transmision>
                            <CodigoCertificado>pruebaPMI</CodigoCertificado>
                            <IdSolicitud>000001</IdSolicitud>
                            <FechaGeneracion>2014-07-15T12:54:47.663+02:00</FechaGeneracion>
                        </Transmision>
                    </DatosGenericos>
                    <DatosEspecificos 
                        xmlns="http://www.map.es/scsp/esquemas/datosespecificos">
                        <Solicitud>
                            <Provincia>
                                <Nombre>Illes Balears</Nombre>
                                <Codigo>07</Codigo>
                            </Provincia>
                            <Municipio>
                                <Codigo>033</Codigo>
                                <Nombre>Manacor</Nombre>
                            </Municipio>
                            <Tutor>SI</Tutor>
                        </Solicitud>
                    </DatosEspecificos>
                </SolicitudTransmision>
            </Solicitudes>
        </Peticion>
    </soapenv:Body>
</soapenv:Envelope>